// ФУНКЦИОНАЛ НА СТРАНИЦЕ "УЧАСТНИКАМ"

// Если вдруг кому-то нужно что-то дописать в этом файле, помимо основного ответственного за эту функциональность,
// лучше это делать внизу, где указаны имена. Если нужно что-то писать прямо посреди чужого кода, то отделяйте
// свой код комментариями со своим именем перед и после вставляемого кода.


// Георгий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -


// скрипт перелистывания шагов формы

// установка слушателя клика на кнопку для открытия формы

// установка слушателей клика на кнопки внутри формы для навигации между шагами

// инициализация установки валидатора формы (нужно обход всех форм на странице, потому что будет еще форма пожертвования в модалке)

// функция отправки формы (обсудить, что делаем, скорее всего отправим на фейковый API)

// ОСНОВНЫЕ ТРЕБОВАНИЯ К ВАЛИДАЦИИ - см. в ТЗ в Notion



// Георгий -> end!


//-------------------------------------------------------------------------


// Никита - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Никита -> end!

// Дмитрий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Дмитрий -> end!

// Андрей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Андрей -> end!

// Алексей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Алексей -> end!

// Евгений - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Евгений -> end!

//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
