// ФУНКЦИОНАЛ МОДАЛЬНЫХ ОКОН

// Если вдруг кому-то нужно что-то дописать в этом файле, помимо основного ответственного за эту функциональность,
// лучше это делать внизу, где указаны имена. Если нужно что-то писать прямо посреди чужого кода, то отделяйте
// свой код комментариями со своим именем перед и после вставляемого кода.


// Андрей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// полный функционал открытия модалки с навешиванием слушателей

// полный функционал закрытия модалки с удалением слушателей

// закрытие модалки по клику на оверлей

// закрытие модалки по нажатию на Esc

// Универсальный обработчик закрытия модалки по крестику

// Открытие модалки с формой пожертвования

// Открытие модалки с формой покупки билета



// Андрей -> end!


//-------------------------------------------------------------------------


// Никита - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Никита -> end!

// Дмитрий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Дмитрий -> end!

// Алексей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Алексей -> end!

// Георгий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Георгий -> end!

// Евгений - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Евгений -> end!

//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
