// ФУНКЦИОНАЛ УНИВЕРСАЛЬНОЙ ВАЛИДАЦИИ ФОРМ (live validation)

// Если вдруг кому-то нужно что-то дописать в этом файле, помимо основного ответственного за эту функциональность,
// лучше это делать внизу, где указаны имена. Если нужно что-то писать прямо посреди чужого кода, то отделяйте
// свой код комментариями со своим именем перед и после вставляемого кода.



// Георгий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// предлагаю брать за основу наработки из проекта Место

// показ ошибки валидации поля

// скрытие ошибки валидации поля

// проверка валидности поля и показать ошибку, если необходимо

// установка валидатора на форму

// проверка наличия невалидного поля

// управление активностью кнопки сабмита

// установка валидатора на все формы на странице

// Функция сброса ошибок при открытии модальных окон

// что-то еще необходимое



// Георгий -> end!


//-------------------------------------------------------------------------


// Никита - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Никита -> end!

// Дмитрий - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -



// Дмитрий -> end!

// Андрей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Андрей -> end!

// Алексей - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Алексей -> end!

// Евгений - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -




// Евгений -> end!

//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
